{
  "movies": [
    {
      "id": 1,
      "title": "Kaakha..Kaakha: The Police",
      "description": "A badly injured Anbuselvan (Suriya) is lying on the bank of a stream, thinking about his wife Maya and how he needs to rescue her. The story moves quickly from this opening scene to a flashback of Anbuselvan\\u2019s time as a young policeman.\nAnbuselvan was an honest, daring IPS officer with the Chennai police as the Assistant Commissioner of Police (ACP) in the Crime Branch. As he has no relations in life, he lived with no fear. Anbuselvan and his friends, Shrikanth (Daniel Balaji), Arul (Vivek Anand) and Ilamaran (Rajan), have been recruited for part of a special unit of police officers who are battling organized crime in Chennai. Violent and laconic, Anbuselvan finds little patience for a personal life. The unit is ruthless in its confrontation with criminals, going as far as assassinating gang members; the unit is finally disbanded by human rights authorities; Anbuselvan is posted to Control Room Duties.\nOne day a school teacher named Maya (Jyothika) rebuffs Anbuselvan's routine questions regarding safety, not knowing that he is a police officer. He meets her again when she and her friend are questioned for driving without a license. However, Anbuselvan lets them off with a warning. When one of Maya\\u2019s students has a problem with local kids, she asks Anbuselvan for help. Anbuselvan resolves this problem, a mutual respect grows between them and they begin seeing one another. When Maya gets into a road accident, Anbuselvan helps her to recover and they fall in love. Shrikanth and his wife, Swathi (Devadarshini), become good friends with Maya.\nIn response to rising levels of crime in the city, when the son of an influential movie producer is kidnapped and killed, the special unit is reassembled by commissioner with all four back in the crime branch. The unit tracks down and kills the head of the gang that was responsible. The brother of the gang leader, Pandiya (played by Jeevan), returns from Mumbai and takes over the gang, promising revenge over his brother\\u2019s death. Pandiya and his gang members target the families of the men in the special unit, but the police close in and a badly injured Pandiya barely escapes Anbuselvan.\nMaya and Anbuselvan get married and leave for Pondicherry. But the next day, Pandiya and his thugs enter the cottage the honeymoon couple are staying in and attack Anbuselvan, leaving him for dead, and kidnapping Maya. This brings the viewer back to the opening scene of the movie, in which Anbuselvan is battling for life, but thinking only about rescuing Maya.\nShrikanth and Arul arrive at the cottage, discover Anbuselvan and take him to the Pondicherry Government Hospital. Shrikanth reveals that his wife Swathi was kidnapped earlier and confesses that it was he who gave away Anbuselvan\\u2019s location to Pandiya, for the safe return of Swathi. Shrikanth feels extreme remorse over what has happened. Whilst in the hospital, they receive a message from Pandiya to meet him at a particular location. When they go there, they find a package containing the severed head of Swathi. Shrikanth is distraught at seeing his wife's head and in an agony of grief and guilt at being responsible, he commits suicide by shooting himself. Anbuselvan tracks down Pandiya before he can escape from Tamil Nadu and fights with the gang. Pandiya stabs Maya to distract her husband and she dies in Anbuselvan\\u2019s arms. An enraged Anbuselvan tracks down Pandiya and, in a final encounter, kills him.\nAn epilogue shows that Anbuselvan, after the death of Maya, continued his job as an IPS officer some weeks later. An alternative ending was shot and placed in the DVD version with a running commentary by Gautham Menon, in which Maya comes alive and he explains why this ending was not used in the version for cinema release."
    }
  ]
}